
**** DONE 今天送孩子到济南报到，并看了两家房子。一般且贵。
     CLOSED: [2016-07-22 Fri 17:00]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-22 Fri 19:13]
     CLOCK: [2016-07-22 Fri 08:30]--[2016-07-22 Fri 17:00] =>  8:30
     - State "STARTED"    from "DONE"       [2016-07-22 Fri 19:12]
     - State "DONE"       from "STARTED"    [2016-07-22 Fri 19:10]
     :END:
8：30出发，走东路不通，改走高速。12点到齐鲁交通发展集团。
5：00到泰安，累。洗车并归家。
*** DONE 复习英语 lesson five 96.6%
    CLOSED: [2016-07-26 Tue 11:51]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 11:51]
    CLOCK: [2016-07-26 Tue 11:28]--[2016-07-26 Tue 11:51] =>  0:23
    - State "STARTED"    from "WAITING"    [2016-07-26 Tue 11:28]
    - State "WAITING"    from "DONE"       [2016-07-26 Tue 09:17]
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 09:17]
    CLOCK: [2016-07-26 Tue 09:16]--[2016-07-26 Tue 09:17] =>  0:01
    :END:

*** DONE <2016-07-26 Tue 03:00>get up and go office begin learning
    CLOSED: [2016-07-26 Tue 04:29]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 04:29]
    - State "STARTED"    from "DONE"       [2016-07-26 Tue 04:28]
    - State "DONE"       from "STARTED"    [2016-07-26 Tue 04:27]
    CLOCK: [2016-07-26 Tue 03:23]--[2016-07-26 Tue 04:00] =>  0:37
    :END:
*** DONE <2016-07-27 Wed 05:00> begin learn and work
    CLOSED: [2016-07-27 Wed 06:14]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:14]
    CLOCK: [2016-07-27 Wed 05:01]--[2016-07-27 Wed 05:03] =>  0:02
    :END:
*** DONE 朗读《道德经》30节
    CLOSED: [2016-07-27 Wed 06:13]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:13]
    CLOCK: [2016-07-27 Wed 05:57]--[2016-07-27 Wed 06:13] =>  0:16
    :END:
*** DONE 到济南给孩子定房子
    CLOSED: [2016-07-27 Wed 14:25]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-27 Wed 14:25]
    CLOCK: [2016-07-27 Wed 06:14]--[2016-07-27 Wed 14:25] =>  8:11
    :END:
*** DONE begin learn and work
    CLOSED: [2016-07-28 Thu 05:24]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-28 Thu 05:24]
    CLOCK: [2016-07-28 Thu 04:02]--[2016-07-28 Thu 04:04] =>  0:02
    :END:
**** DONE clean and relax
     CLOSED: [2016-07-28 Thu 06:51]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-28 Thu 06:51]
     CLOCK: [2016-07-28 Thu 06:13]--[2016-07-28 Thu 06:51] =>  0:38
     :END:
**** DONE relax and brow
     CLOSED: [2016-07-30 Sat 07:21]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-30 Sat 07:21]
     CLOCK: [2016-07-30 Sat 06:03]--[2016-07-30 Sat 07:21] =>  1:18
     :END:
浏览了系列图书：有关程序、英语学习的等。

*** DONE 复制和粘贴剩余文本
    CLOSED: [2016-07-29 Fri 15:09]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-29 Fri 15:09]
    CLOCK: [2016-07-29 Fri 15:03]--[2016-07-29 Fri 15:09] =>  0:06
    :END:
 map V :w^M:!ispell % ^M:e!^M^M

 第二个^M使你在拼写检查完之后无须敲回车就可以到vi中.
 (译注, 在我的系统里,没有ispell,只有spell,我用它替换了ispell,工作的不错;还有,
 ^M不是两个字符,而是一个字符,通过^V^M敲进去的;另外,我个人认为第二个^M还是不要
 的好,因为直接回到vi后你就无法看到拼写检查的结果了)
  移动
*** DONE 练习一遍
    CLOSED: [2016-07-22 Fri 20:43]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-22 Fri 20:43]
    CLOCK: [2016-07-22 Fri 20:25]--[2016-07-22 Fri 20:43] =>  0:18
    :END:
*** DONE 学习查找替换
    CLOSED: [2016-07-23 Sat 16:59]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2016-07-23 Sat 16:59]
    CLOCK: [2016-07-23 Sat 16:45]--[2016-07-23 Sat 16:59] =>  0:14
    :END:
**** DONE <2016-07-24 Sun 03:47> 到达办公室开始学习工作
     CLOSED: [2016-07-27 Wed 06:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-07-27 Wed 06:13]
     CLOCK: [2016-07-24 Sun 03:48]--[2016-07-24 Sun 03:52] =>  0:04
     :END:

**** DONE begin learning and working
     CLOSED: [2016-08-01 Mon 05:32]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 05:32]
     CLOCK: [2016-08-01 Mon 03:38]--[2016-08-01 Mon 03:40] =>  0:02
     :END:

**** DONE brow and lean
     CLOSED: [2016-08-01 Mon 06:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 06:01]
     CLOCK: [2016-08-01 Mon 05:35]--[2016-08-01 Mon 06:01] =>  0:26
     :END:
朗读《道德经》25节

**** DONE learn vim edit
     CLOSED: [2016-08-01 Mon 21:23]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-01 Mon 21:23]
     CLOCK: [2016-08-01 Mon 19:29]--[2016-08-01 Mon 21:23] =>  1:54
     :END:
大家來學VIM（一個歷久彌新的編輯器）
http://www.study-area.org/tips/vim/index.html
C-f page down
C-b page up

本節所述皆是在 common-mode(c-mode，在 vim 又名 normal-mode)下的移動，原始的 vi 只能在 c-mode 移動游標，在 insert-mode 只做文字的輸入，而不做游標的移動。當然 vim 及 elvis 的方向鍵是不論在那一種 mode 皆可移動自如。


基本的游標移動
h  左，或 Backspace 或方向鍵
j  下，或 Enter 或 +（要 Shift 鍵），或方向鍵
k  上，或 方向鍵或 -（不必 Shift 鍵）
l  右，或 Space 或方向鍵
使用 hjkl 鍵的移動是為了使手不必離開打字區（鍵盤中央的部位），以加快打字的速度，如果各位不習慣，那就使用方向鍵吧！
Backspace 及 Space 的移動方式是到了行首或行尾時會折行，但方向鍵或 hl 鍵的移動則在行首或行尾時您繼續按也不會折行。轉折換行的功能是 vim 的擴充功能，elvis 無此功能。
jk 及使用方向鍵的上下移動游標會盡量保持在同一欄位。使用 Enter，+，- 的上下移動，游標會移至上（下）一行的第一個非空白字元處。
好像有點複雜，各位就暫時使用方向鍵來移動就簡單明白了！等您愛上了 vim 後再來講究吧。
 Ctrl-f    即 PageDown 翻頁。
Crtl-b    即 PageUp 翻頁。


進階的游標移動
0  是數目字 0 而不是英文字母 o。或是 Hmoe 鍵，移至行首，
   （含空白字元）。
^  移至第一個非空白字元，注意，要 Shift 鍵。
$  移至行尾，或 End 鍵。要 Shift 鍵。
以上兩個按鍵是源自規則表示式（regular expression），在 regexp 中 ^ 是匹配行首，$ 是匹配行尾。
 G  移至檔尾（最後一行的第一個非空白字元處）
gg 移至檔首（第一行之第一個非空白字元處）
gg 是 vim 的擴充功能，在 elvis 或原始 vi 中可用 1G 來移至檔首（是數字 1 不是英文字 l）。
G 之原意是 goto，指移至指定數目行之行首，如不指定數目，則預設是最後一行。
 w  移至次一個字（word）字首。當然是指英文單字。
W  同上，但會忽略一些標點符號。
e  移至前一個字字尾。
E  同上，但會忽略一些標點符號。
b  移至前一個字字首。
B  同上，但會忽略一些標點符號。
H  移至螢幕頂第一個非空白字元。
M  移至螢幕中間第一個非空白字元。
L  移至螢幕底第一個非空白字元。
這和 PageDown，PageUp 不一樣，內文內容並未動，只是游標在動而已。
 n| 移至第 n 個字元(欄)處。注意，要用 Shift 鍵。n 是從頭起
   算的。
:n 移至第 n 行行首。或 nG。


特殊的移動
)  移至下一個句子（sentence）首。
(  移至上一個句子（sentence）首。
}  移至下一個段落（paragraph）首。
{  移至上一個段落（paragraph）首。
sentence 是以 . ! ? 為區格。
paragraph 是以空白行為區格。
 %  這是匹配 {}，[]，() 用的，例如您的游標現在在 { 上
   只要按 %，就會跑到相匹配的 } 上。寫程式時滿好用的。


另還有一些 vim 的特殊按鍵，但這得留待最後才來講述，否則各位恐怕會頭昏眼花了。

前單元	次單元	目　錄

**** DONE begin learning and working
     CLOSED: [2016-08-02 Tue 05:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 05:13]
     CLOCK: [2016-08-02 二 05:02]--[2016-08-02 Tue 05:13] =>  0:11

     :END:
重装spacemacs
载入出现文件目录错误，重新安装ya...解决
还有一错误ispell
用M-x install package 两遍排队错误

**** DONE begin learning and working
     CLOSED: [2016-08-02 Tue 05:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 05:13]
     CLOCK: [2016-08-02 二 05:02]--[2016-08-02 Tue 05:13] =>  0:11

     :END:
重装spacemacs
载入出现文件目录错误，重新安装ya...解决
还有一错误ispell
用M-x install package 两遍排队错误

**** DONE relaxing and browing
     CLOSED: [2016-08-02 Tue 07:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 07:01]
     CLOCK: [2016-08-02 Tue 06:49]--[2016-08-02 Tue 07:01] =>  0:12
     :END:

**** DONE begin learning and work
     CLOSED: [2016-08-02 Tue 11:28]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 11:28]
     CLOCK: [2016-08-02 Tue 08:09]--[2016-08-02 Tue 08:11] =>  0:02
     :END:

**** DONE 重新安装spacemacs
     CLOSED: [2016-08-02 Tue 19:08]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-02 Tue 19:08]
     CLOCK: [2016-08-02 Tue 18:50]--[2016-08-02 Tue 19:08] =>  0:18
     :END:
日记文件不指向journal.org 仍指向!journal.org
不知何故。
**** DONE begin learning and working
     CLOSED: [2016-08-03 Wed 06:36]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-03 Wed 06:36]
     CLOCK: [2016-08-03 Wed 04:19]--[2016-08-03 Wed 04:24] =>  0:05
     :END:

**** DONE begin learning and working
     CLOSED: [2016-08-04 Thu 07:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-04 Thu 07:01]
     CLOCK: [2016-08-04 Thu 03:46]--[2016-08-04 Thu 03:48] =>  0:02
     :END:
**** DONE 深思与总结
     CLOSED: [2016-08-05 Fri 11:16]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-05 Fri 11:16]
     CLOCK: [2016-08-05 Fri 08:54]--[2016-08-05 Fri 11:16] =>  2:22
     :END:
3850 characters
**** DONE 今天早上3：00起。
     CLOSED: [2016-08-06 Sat 10:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-06 Sat 10:18]
     CLOCK: [2016-08-06 Sat 10:17]--[2016-08-06 Sat 10:18] =>  0:01
     :END:
到车里复习三课。温故知新。真理。
知识学习到永远不忘才算完成。
特别是语言，达到听懂、会写、熟用。才行
不求快。只求会。
8:40给物业打电话，来修下水。最报还是自己做的。不过把手弄破了。以后要千万小心。活只能让别人干。
淋溶头移位完成。
其它已发短信给房主。没回。再落实。
**** DONE relax and listening Engish songs
     CLOSED: [2016-08-08 Mon 07:03]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-08 Mon 07:03]
     CLOCK: [2016-08-08 Mon 06:27]--[2016-08-08 Mon 07:03] =>  0:36
     :END:

**** DONE notes
     CLOSED: [2016-08-08 一 11:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-08 一 11:49]
     CLOCK: [2016-08-08 一 11:21]--[2016-08-08 一 11:49] =>  0:28
     :END:
作者：Bird Frank
链接：http://www.zhihu.com/question/19712884/answer/49422221
来源：知乎
著作权归作者所有，转载请联系作者获得授权。

我基本没有使用过vim，因此只针对Emacs的情况来说。其实最初是想针对
为什么有的程序员极度推崇 Vim 和 Emacs，却对 IDE 嗤之以鼻？?? - 编程这个问题进行
回答的，但是第一，我并不会对任何IDE或使用IDE的人“嗤之以鼻”，其次我也不认为一个认真的
Emacs用户会对IDE嗤之以鼻，因此就没法回答这个以“为什么”开头的问题了。后来发现我
想说的内容针对现在这个问题更合适，所以就发到这里来啦。


先说说Emacs和IDE比较的问题。Emacs不是一个简单的文本编辑器，能做到事情远远超过IDE。
如果只用Emacs来编写代码，那么相当于拿了一把瑞士军刀却只用它的主刀片。


说说我自己吧，以前我用Eclipse写J2EE软件，后来用Textmate写RoR软件；用Word写文档，
还要一个工具来画UML图，导出成图片后再插入Word文档。到了Mac上以后改用Pages，流程
还是差不多。用Evernote记笔记，用过一些GTD的软件来做任务管理，尝试过几次写博客，
都是在浏览器里直接编辑的那种。


目前这些任务都在Emacs里完成啦：

+ RoR的代码自然在Emacs里完成，前两个月刚在Emacs里配了Android的开发环境开始学习
  Android。iOS的软件还是用xCode，主要因为目前基本不做iOS的开发，只是偶尔看看别人
  的代码，做些小修改，因此暂时没有在Emacs里配开发环境。

+ 技术文档用org-mode写，然后导出成PDF；UML图用PlantUML画，在org-mode里一气呵成，
  再也不用在不同软件间倒来倒去了。而且可以在文档里插入带语法高亮的源代码，这一点
  我现在也不知道怎么在Word或Pages来实现。

+ Evernote的编辑功能实在太弱，又不支持Markdown，因此目前正在逐渐用org-mode来代替。
  用了deft插件，搜索笔记非常方便。

+ 博客的话用jekyll，自然也是在Emacs里用Markdown写，然后再发布到github上。这个答
  案就是在Emacs里写的，稍后只要做下```git push```就可以发布到我的博客上去了。

+ 任务管理也是用org-mode，接下去准备尝试把日程管理也从Calendar切换到org-mode来。

所有这些任务都有一个共同点，就是他们都有很多文字输入和编辑工作。如果象以前那样要
用不同软件来完成的话，每个软件的编辑功能多少都有些不同，强弱差别非常大。而统一使
用Emacs以后，虽然Emacs的学习曲线有些陡，但是只要学会了以后，在所有这些任务中都能
用到。而且因为专注一个软件，每天大量的时间使用它，很快就很学会和数量使用了。


Emacs有强大的定制功能，可以完全根据个人的习惯、喜好来把它“调教”成个人专属的功
能。而且这种“定制化”的投资对于上述的所有任务都有价值，投资回报超高。


可以说使用Emacs完成的任务越多，用在学习和定制化上的“投资”就越有价值。

使用Emacs的另一个原因是为了贯彻KISS（Keep It Simple）原则。有人可能觉得Emacs超复
杂，并且因此而望而却步，不愿意去学习它。但是一旦学会了，用一个Emacs来代替一堆其
它软件的时候，你就会发现生活一下子简单了很多。不再需要面对很多软件上面那些根本不
会用到的菜单、按钮，而只专注于完成日常任务所需要的那些最常用的功能上，然后用最有
效率的方式去完成它们。

作者：Bird Frank
链接：http://www.zhihu.com/question/19712884/answer/49422221
来源：知乎
著作权归作者所有，转载请联系作者获得授权。

我基本没有使用过vim，因此只针对Emacs的情况来说。其实最初是想针对
为什么有的程序员极度推崇 Vim 和 Emacs，却对 IDE 嗤之以鼻？?? - 编程这个问题进行
回答的，

但是第一，我并不会对任何IDE或使用IDE的人“嗤之以鼻”，其次我也不认为一个认真的
Emacs用户会对IDE嗤之以鼻，因此就没法回答这个以“为什么”开头的问题了。后来发现我
想说的内容针对现在这个问题更合适，所以就发到这里来啦。


先说说Emacs和IDE比较的问题。Emacs不是一个简单的文本编辑器，能做到事情远远超过IDE。
如果只用Emacs来编写代码，那么相当于拿了一把瑞士军刀却只用它的主刀片。


说说我自己吧，以前我用Eclipse写J2EE软件，后来用Textmate写RoR软件；用Word写文档，
还要一个工具来画UML图，导出成图片后再插入Word文档。到了Mac上以后改用Pages，流程
还是差不多。用Evernote记笔记，用过一些GTD的软件来做任务管理，尝试过几次写博客，
都是在浏览器里直接编辑的那种。


目前这些任务都在Emacs里完成啦：

+ RoR的代码自然在Emacs里完成，前两个月刚在Emacs里配了Android的开发环境开始学习
  Android。iOS的软件还是用xCode，主要因为目前基本不做iOS的开发，只是偶尔看看别人
  的代码，做些小修改，因此暂时没有在Emacs里配开发环境。
+ 技术文档用org-mode写，然后导出成PDF；UML图用PlantUML画，在org-mode里一气呵成，
  再也不用在不同软件间倒来倒去了。而且可以在文档里插入带语法高亮的源代码，这一点
  我现在也不知道怎么在Word或Pages来实现。
+ Evernote的编辑功能实在太弱，又不支持Markdown，因此目前正在逐渐用org-mode来代替。
  用了deft插件，搜索笔记非常方便。
+ 博客的话用jekyll，自然也是在Emacs里用Markdown写，然后再发布到github上。这个答
  案就是在Emacs里写的，稍后只要做下```git push```就可以发布到我的博客上去了。
+ 任务管理也是用org-mode，接下去准备尝试把日程管理也从Calendar切换到org-mode来。

所有这些任务都有一个共同点，就是他们都有很多文字输入和编辑工作。如果象以前那样要
用不同软件来完成的话，每个软件的编辑功能多少都有些不同，强弱差别非常大。而统一使
用Emacs以后，虽然Emacs的学习曲线有些陡，但是只要学会了以后，在所有这些任务中都能
用到。而且因为专注一个软件，每天大量的时间使用它，很快就很学会和数量使用了。


Emacs有强大的定制功能，可以完全根据个人的习惯、喜好来把它“调教”成个人专属的功
能。而且这种“定制化”的投资对于上述的所有任务都有价值，投资回报超高。


可以说使用Emacs完成的任务越多，用在学习和定制化上的“投资”就越有价值。

使用Emacs的另一个原因是为了贯彻KISS（Keep It Simple）原则。有人可能觉得Emacs超复
杂，并且因此而望而却步，不愿意去学习它。但是一旦学会了，用一个Emacs来代替一堆其
它软件的时候，你就会发现生活一下子简单了很多。不再需要面对很多软件上面那些根本不
会用到的菜单、按钮，而只专注于完成日常任务所需要的那些最常用的功能上，然后用最有
效率的方式去完成它们。

http://link.zhihu.com/?target=http%3A//www.cnblogs.com/zhuweisky/p/4811408.html
**** DONE 友杰到家商谈事情
     CLOSED: [2016-08-11 四 21:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-11 四 21:49]
     CLOCK: [2016-08-11 四 19:43]--[2016-08-11 四 21:00] =>  1:17
     - State "STARTED"    from "DONE"       [2016-08-11 四 21:43]
     :END:
     - State "DONE"       from "STARTED"    [2016-08-11 四 21:43]
**** DONE browers and search
     CLOSED: [2016-08-16 二 05:56]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-16 二 05:56]
     CLOCK: [2016-08-16 二 05:19]--[2016-08-16 二 05:56] =>  0:02
     :END:
Done it is better than profact.
**** DONE 陪同夫人孩子购物
     CLOSED: [2016-08-16 二  17:47]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-16 二 18:03]
     CLOCK: [2016-08-16 二 14:02]--[2016-08-16 二 17:47] =>  3:45
     :END:

累啊，在车里休息了一会。
****** DONE my daughter is married.
       CLOSED: [2016-08-18 四 17:31]
       :LOGBOOK:
       - State "DONE"       from "STARTED"    [2016-08-18 四 17:31]
       CLOCK: [2016-08-18 四 04:46]--[2016-08-18 四 17:31] => 12:45
       :END:

****** DONE 朗读《道德经》20余节
       CLOSED: [2016-08-19 五 07:03]
       :LOGBOOK:
       - State "DONE"       from "STARTED"    [2016-08-19 五 07:03]
       CLOCK: [2016-08-19 五 06:48]--[2016-08-19 五 07:03] =>  0:15
       :END:

**** DONE search Done is better than perfect.
     CLOSED: [2016-08-21 Sun 09:43]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 09:43]
     CLOCK: [2016-08-21 Sun 08:21]--[2016-08-21 Sun 09:43] =>  1:22
     :END:
Facebook的标语
http://www.ruanyifeng.com/blog/2012/02/facebook_slogans.html

七个对我最重要的职业建议（译文）
七个对我最好的职业建议（精简版）
作者：Nicholas C. Zakas
译者：阮一峰
原文网址：https://www.nczonline.net/blog/2013/10/15/the-best-career-advice-ive-received/

**** DONE arrive office begin work
     CLOSED: [2016-08-21 日 18:41]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 日 18:41]
     CLOCK: [2016-08-21 Sun 13:50]--[2016-08-21 Sun 13:51] =>  0:01
     :END:

**** DONE browse Yin wang's pages
     CLOSED: [2016-08-21 Sun 15:06]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 15:06]
     CLOCK: [2016-08-21 Sun 14:18]--[2016-08-21 Sun 15:06] =>  0:48
     :END:

**** DONE browse and learn
     CLOSED: [2016-08-21 Sun 18:28]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 Sun 18:28]
     CLOCK: [2016-08-21 Sun 17:41]--[2016-08-21 Sun 18:28] =>  0:47
     :END:
阅读程序猿的呐喊

**** DONE Elisp learning
     CLOSED: [2016-08-21 日 21:30]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-21 日 21:30]
     CLOCK: [2016-08-21 日 20:29]--[2016-08-21 日 21:30] =>  0:01
     :END:
begin learn Elisp and Ruby
**** DONE arrive office and begin clean in order
     CLOSED: [2016-08-22 一 08:33]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-22 一 08:33]
     CLOCK: [2016-08-22 一 07:47]--[2016-08-22 一 08:33] =>  0:46
     :END:

**** DONE 李玲来访
     CLOSED: [2016-08-25 四 11:15]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-25 四 11:15]
     CLOCK: [2016-08-25 四 9:20]--[2016-08-25 四 10:15] =>  0:55
     :END:

**** DONE 企业来访
     CLOSED: [2016-08-25 四 11:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-25 四 11:18]
     CLOCK: [2016-08-25 四 10:17]--[2016-08-25 四 11:18] =>  1:01
     :END:

**** DONE relax and listen music
     CLOSED: [2016-08-26 五 05:47]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-26 五 05:47]
     CLOCK: [2016-08-26 五 05:08]--[2016-08-26 五 05:47] =>  0:39
     - State "STARTED"    from "DONE"       [2016-08-26 五 05:08]
     - State "DONE"       from "STARTED"    [2016-08-26 五 05:08]
     :END:

**** DONE 今天到姐姐家看振府。
     CLOSED: [2016-08-27 六 15:40]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-27 六 15:40]
     CLOCK: [2016-08-27 六 8:00]--[2016-08-27 六 15:00] =>  7:00
     - State "STARTED"    from "DONE"       [2016-08-27 六 15:37]
     - State "DONE"       from "STARTED"    [2016-08-27 六 15:37]
     :END:
精神很好。吃中药，300元一幅，45次。包好？
姐姐姐夫身体好。
农村空气真好。田园风光。如果全部变为森林，会如何？ 模拟器模拟？有意义！
**** DONE school
     CLOSED: [2016-08-28 日 11:29]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-28 日 11:29]
     CLOCK: [2016-08-28 日 11:10]--[2016-08-28 日 11:29] =>  0:19
     :END:
北京力迈外国语学校NEWS

**** DONE 到济南拜访客人
     CLOSED: [2016-08-29 Mon 16:25]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-29 Mon 7:45]
     CLOCK: [2016-08-29 Mon 7:45]--[2016-08-29 Mon 16:25] =>  8:40
     :END:

**** DONE arrive office and clean up
     CLOSED: [2016-08-23 二 08:14]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-08-23 二 08:14]
     CLOCK: [2016-08-23 二 07:42]--[2016-08-23 二 08:14] =>  0:32
     :END:
  李强来访；陈书记来安排下午会议：先进评选
  客观评价60%民主推荐40%
**** DONE arrive office and begin learning
     CLOSED: [2016-09-05 一 04:34]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-05 一 04:34]
     CLOCK: [2016-09-05 一 04:29]--[2016-09-05 一 04:30] =>  0:01
     :END:

**** DONE arrive office and begin clean up
     CLOSED: [2016-09-05 一 09:38]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-05 一 09:38]
     CLOCK: [2016-09-05 一 07:29]--[2016-09-05 一 09:38] =>  2:09
     :END:

**** STARTED arrive office and begin working
     :LOGBOOK:
     CLOCK: [2016-09-05 Mon 14:04]--[2016-09-05 Mon 14:17] =>  0:13
     :END:

**** DONE my wife goes to shopping
     CLOSED: [2016-09-05 Mon 20:01]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-05 Mon 20:01]
     CLOCK: [2016-09-05 Mon 19:00]--[2016-09-05 Mon 20:01] =>  1:01
     :END:

**** DONE arrive office and begin work
     CLOSED: [2016-09-06 二 14:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-06 二 14:18]
     CLOCK: [2016-09-06 二 14:03]--[2016-09-06 二 14:18] =>  0:15
     :END:
clean up and prepare working
**** DONE arrive office and begin learning
     CLOSED: [2016-09-07 三 04:45]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-07 三 04:45]
     CLOCK: [2016-09-07 三 04:41]--[2016-09-07 三 04:45] =>  0:04
     :END:
drink honey with water

**** DONE read loud 《道德经》
     CLOSED: [2016-09-07 三 06:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-07 三 06:49]
     CLOCK: [2016-09-07 三 06:36]--[2016-09-07 三 06:49] =>  0:13
     :END:

**** DONE today is raining in the morning.
     CLOSED: [2016-09-07 三 06:56]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-07 三 06:56]
     CLOCK: [2016-09-07 三 06:53]--[2016-09-07 三 06:56] =>  0:03
     :END:
It is cold. I can't walk outside, so I work out in my office.

**** DONE 检查晚自习情况
     CLOSED: [2016-09-07 三 19:50]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-07 三 19:50]
     CLOCK: [2016-09-07 三 19:32]--[2016-09-07 三 19:50] =>  0:18
     :END:
学生观看影片休闲放松。
**** DONE apple published
     CLOSED: [2016-09-08 四 06:27]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-08 四 06:27]
     CLOCK: [2016-09-08 四 04:05]--[2016-09-08 四 06:27] =>  2:22
     :END:

**** DONE arrive office and clean up
     CLOSED: [2016-09-08 四 08:11]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-08 四 08:11]
     CLOCK: [2016-09-08 四 07:57]--[2016-09-08 四 08:11] =>  0:14
     :END:
sitting down and bein work

**** DONE 红杉来访
     CLOSED: [2016-09-08 四 17:08]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-08 四 17:08]
     CLOCK: [2016-09-08 四 15:16]--[2016-09-08 四 17:08] =>  1:52
     :END:
**** DONE read loud 《道德经》
     CLOSED: [2016-09-09 五 06:32]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-09 五 06:32]
     CLOCK: [2016-09-09 五 06:23]--[2016-09-09 五 06:32] =>  0:09
     :END:
圣人之道，为而不争。

**** DONE 与郞法希及家长谈话
     CLOSED: [2016-09-10 六 10:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-10 六 10:49]
     CLOCK: [2016-09-10 六 10:00]--[2016-09-10 六 10:49] =>  0:49
     :END:

**** DONE arrive office and begin learning
     CLOSED: [2016-09-11 日 04:14]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-11 日 04:14]
     CLOCK: [2016-09-11 日 04:10]--[2016-09-11 日 04:14] =>  0:04
     :END:

**** DONE 知识及技能掌握的三个层次
     CLOSED: [2016-09-11 日 05:41]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-11 日 05:41]
     CLOCK: [2016-09-11 日 05:30]--[2016-09-11 日 05:41] =>  0:11
     :END:

1. 95%及以下没掌握
2. 98%及以下算基本掌握
3. 99.5%及以上才算熟练掌握，并且非偶然，三次要两次达到此标准。
所以学知识和技能不能只求知道，只有真正熟练掌握才能算完成，才能进行下一步。
要有好的工具，现有的英语学习工具都不能满足，适时自己开发。
要求：
1. 记录每次学习时间、准确率含日期等详细信息，并显示学习历程提升曲线。
2. 关键词填空方式学习
3. 声音、图像加印象。
4. 掌握单词评估统计。
**** DONE 王院长来检查教学情况
     CLOSED: [2016-09-12 一 08:54]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-12 一 08:54]
     CLOCK: [2016-09-12 一 08:01]--[2016-09-12 一 08:54] =>  0:53
     :END:

******** DONE arrive office and begin work
         CLOSED: [2016-09-12 一 13:41]
         :LOGBOOK:
         - State "DONE"       from "STARTED"    [2016-09-12 一 13:41]
         CLOCK: [2016-09-12 一 13:39]--[2016-09-12 一 13:41] =>  0:02
         :END:
**** DONE arrive office begin check teach
     CLOSED: [2016-09-14 三 08:11]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-14 三 08:11]
     CLOCK: [2016-09-14 三 07:59]--[2016-09-14 三 08:11] =>  0:12
     :END:

**** DONE read loud 《道德经》20小节
     CLOSED: [2016-09-15 四 07:41]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-15 四 07:41]
     CLOCK: [2016-09-15 四 07:22]--[2016-09-15 四 07:41] =>  0:09
     :END:
给大家发一大红包168元。

**** DONE take wife to the sister's home
     CLOSED: [2016-09-16 五 11:02]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-16 五 11:02]
     CLOCK: [2016-09-16 五 09:00]--[2016-09-16 五 11:02] =>  2:02
     :END:

**** DONE today begin hand ache, relax
     CLOSED: [2016-09-16 五 21:53]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-16 五 21:53]
     CLOCK: [2016-09-16 五 20:05]--[2016-09-16 五 21:53] =>  1:48
     :END:
**** DONE arrive office prepare to learn
     CLOSED: [2016-09-17 六 04:13]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-17 六 04:13]
     CLOCK: [2016-09-17 六 04:10]--[2016-09-17 六 04:13] =>  0:03
     :END:

**** DONE check teaching and learning
     CLOSED: [2016-09-19 一 09:10]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-19 一 09:10]
     CLOCK: [2016-09-19 一 07:50]--[2016-09-19 一 09:10] =>  1:20
     :END:
王院长来听课

**** DONE updata
     CLOSED: [2016-09-24 六 05:30]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-24 六 05:30]
     CLOCK: [2016-09-24 六 04:28]--[2016-09-24 六 05:30] =>  1:02
     :END:
**** DONE arrvie office and begin work
     CLOSED: [2016-09-27 二 18:19]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-09-27 二 18:19]
     CLOCK: [2016-09-27 二 14:36]--[2016-09-27 二 18:19] =>  3:43
     :END:

**** STARTED arrive office begin clean up
     :LOGBOOK:
     CLOCK: [2016-09-30 Fri 04:52]--[2016-09-30 Fri 04:57] =>  0:05
     :END:

**** DONE arrive office and clean up
     CLOSED: [2016-10-05 三 04:18]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-05 三 04:18]
     CLOCK: [2016-10-05 三 04:12]--[2016-10-05 三 04:18] =>  0:06
     :END:
**** DONE updata system
     CLOSED: [2016-10-06 四 04:39]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-06 四 04:39]
     CLOCK: [2016-10-06 四 04:18]--[2016-10-06 四 04:39] =>  0:01
     :END:
**** DONE arrive office and begin clean up
     CLOSED: [2016-10-14 五 08:06]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-14 五 08:06]
     CLOCK: [2016-10-14 五 07:53]--[2016-10-14 五 08:06] =>  0:13
     :END:
**** DONE arrive office and clean up
     CLOSED: [2016-10-18 二 08:02]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-18 二 08:02]
     CLOCK: [2016-10-18 二 07:57]--[2016-10-18 二 08:02] =>  0:05
     :END:
***** DONE 北航计算机学院作报告
      CLOSED: [2016-10-22 Sat 11:08]
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2016-10-22 Sat 11:08]
      CLOCK: [2016-10-22 Sat 09:22]--[2016-10-22 Sat 11:08] =>  1:46
      :END:
**** DONE arrive office
     CLOSED: [2016-11-03 四 16:22]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-11-03 四 16:22]
     CLOCK: [2016-11-03 四 06:43]--[2016-11-03 四 12:30] =>  5:47
     :END:
上午到济南看房子，不理想，否决。
下午到市政府采集生物信息。

**** STARTED 下午到市政府采集生物信息。
     :LOGBOOK:
     CLOCK: [2016-11-03 四 16:26]--[2016-11-03 四 17:27] =>  1:01
     :END:
**** STARTED arrive office and begin to work
     :LOGBOOK:
     CLOCK: [2017-01-12 Thu 07:42]--[2017-01-12 Thu 09:48] =>  2:06
     :END:

**** STARTED begin to work
     :LOGBOOK:
     CLOCK: [2017-01-12 Thu 14:41]--[2017-01-12 Thu 14:43] =>  0:02
     :END:
**** DONE arrive office and begin to learn
     CLOSED: [2017-01-14 Sat 15:53]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2017-01-14 Sat 15:53]
     CLOCK: [2017-01-14 Sat 05:34]--[2017-01-14 Sat 05:35] =>  0:01
     :END:

**** DONE arrive office and being to learn English
     CLOSED: [2017-01-14 Sat 15:53]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2017-01-14 Sat 15:53]
     CLOCK: [2017-01-14 Sat 15:11]--[2017-01-14 Sat 15:19] =>  0:08
     :END:

****go home<2017-01-14 Sat 21:17>
*** DONE 2017-01-16 星期一
    CLOSED: [2017-01-16 一 15:27]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-01-16 一 15:27]
    CLOCK: [2017-01-16 一 15:24]--[2017-01-16 一 15:27] =>  0:03
    :END:

****<2025-02-15 六>
今天购买电暖器一个，500元整
中午在蓝海大酒店吃自助餐
下午修好办公电话。
**** DONE check back
     CLOSED: [2017-01-17 Tue 16:49]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2017-01-17 Tue 16:49]
     CLOCK: [2017-01-17 Tue 16:48]--[2017-01-17 Tue 16:49] =>  0:01
     :END:
检查特殊教育中心
北入口售楼处西，有监控立杆。
节能建筑势在必行。

建筑基本条件太差。
**** DONE arrive office and begin to learn English
     CLOSED: [2017-01-20 五 21:46]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2017-01-20 五 21:46]
     CLOCK: [2017-01-20 五 05:50]--[2017-01-20 五 05:52] =>  0:02
     :END:
**** DONE arrive office and begin to learn English
     CLOSED: [2017-01-29 日 09:51]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2017-01-29 日 09:51]
     - State "STARTED"    from "DONE"       [2017-01-29 日 09:49]
     CLOCK: [2017-01-29 日 09:49]--[2017-01-29 日 09:51] =>  0:02
     - State "DONE"       from "STARTED"    [2017-01-29 日 09:48]
     CLOCK: [2017-01-29 日 05:31]--[2017-01-29 日 05:32] =>  0:01
     :END:

****daughter and her husband return home

